app/controllers/books_controller.rb

 	def index
 	  if params[:category].blank?
 	   @books = Book.all.order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books" ORDER BY created_at DESC

 	def create
 		@book = current_user.books.build(book_params)
 		#when user select category , category id associate with book
 		@book.category_id = params[:category_id]

 		if @book.save
---
INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)

 	def update
 		@book.category_id = params[:category_id]
 		if @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "In Search of Lost Time by Marcel Proust part-1"], ["updated_at", "2017-10-13 20:44:48.574173"], ["id", 1]]